app/views/users/show.html.erb

  <dt><strong>内訳</strong></dt>
  <% @user.event_users.each do |event_user| %>
---
SELECT `event_users`.* FROM `event_users` WHERE `event_users`.`user_id` = 3