app/views/events/show.html.erb

SELECT `event_users`.* FROM `event_users` WHERE `event_users`.`event_id` = 1
---
  <dt><strong>参加者</dt>
  <% @event.event_users.each do |event_user| %>