app/controllers/events_controller.rb

SELECT `events`.* FROM `events`
---
  def index
    @events = Event.all

SELECT `users`.* FROM `users`
---
  def new
    @event = Event.new
    User.all.each do |user|

INSERT INTO `events` (`name`, `amount`, `comment`, `created_at`, `updated_at`) VALUES ('BCI部忘年会', -111200, '116200円から高柳さん', '2015-12-27 17:51:50', '2015-12-27 17:51:50')
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE `events` SET `comment` = '116200円から高柳さん5000円分を引いたお金', `updated_at` = '2015-12-27 17:52:08' WHERE `events`.`id` = 30
---
  def update
    respond_to do |format|
      if @event.update(event_params)

DELETE FROM `events` WHERE `events`.`id` = 1
---
  def destroy
    @event.destroy

SELECT  `events`.* FROM `events` WHERE `events`.`id` = 29 LIMIT 1
---
    def set_event
      @event = Event.find(params[:id])